"""
Subarrays Distinct Element Sum of Squares I.

Дан массив целых положительных чисел nums, размер которого не превосходит 100.
Скором подмассива называется кол-во уникальных чисел в нем. Найти сумму
квадратов скоров всех подмассивов в nums.

Так как размер массива маленький, то используем симуляцию процесса и проходим
в цикле по каждому подмассиву. Для каждого стартового индекса создаем пустое
множество и счетчик уникальных элементов. Если элемента нет во множестве, то
добавляем его и увеличиваем счетчик на 1. На каждом шаге внутреннего цикла
прибавляем квадрат счетчика к ответу.

Лучшее решение: 20 ms (66.46%), 19.16 Mb (91.08%)
#array #simulation
"""


class Solution:

    def sumCounts(self, nums: list[int]) -> int:
        ans = 0
        n = len(nums)
        for i in range(n):
            s = set()
            cnt = 0
            for j in range(i, n):
                num = nums[j]
                if num not in s:
                    s.add(num)
                    cnt += 1
                ans += cnt * cnt
        return ans
