"""
Stone Game III.

Дан массив stoneValue, содержащий целые числа. Алиса и Боб играют в игру. За
один ход можно взять 1, 2 или 3 числа из начала массива и прибавить их к сумме
своих очков. Следующий игрок берет значения уже из оставшегося подмассива.
Изначально сумма очков у каждого игрока равна 0. Алиса ходит первой. Выяснить,
кто победит в игре, если Алиса и Боб играют оптимально.

Используем динамическое программирование. dp[i] - максимальный выигрыш игрока,
который ходит первым на подмассиве stoneValue[i:], т.е. dp[i] = очки игрока 1
- очки игрока 2. У игрока 1 в общем случае есть 3 варианта хода:
- Взять только stoneValue[i], тогда второй игрок при оптимальной для себя игре
  получит выигрыш dp[i + 1:], а для первого игрока выиграш составит
  stoneValue[i] - dp[i + 1:].
- Взять числа stoneValue[i] и stoneValue[i + 1], тогда выигрыш второго игрока
  равен dp[i + 2:], а конечный итог для игрока 1 =
  stoneValue[i] + stoneValue[i + 1] - dp[i + 2:].
- Взять числа stoneValue[i], stoneValue[i + 1] и stoneValue[i + 2], тогда
  получим stoneValue[i] + stoneValue[i + 1] + stoneValue[i + 2] - dp[i + 3:].
Так как игрок выбирает оптимальную стратегию, то ему нужно взять максимум из
этих значений, то есть dp[i] = max(
    stoneValue[i] - dp[i + 1:],
    stoneValue[i] + stoneValue[i + 1] - dp[i + 2:],
    stoneValue[i] + stoneValue[i + 1] + stoneValue[i + 2] - dp[i + 3:],
)

Заполнение идет справа налево, при этом каждое новое значение зависит только
от 3-х предыдущих, поэтому можно не хранить весь массив dp, а только обновлять
3 переменные. Ответ формируется на основе dp[0]. Так как Алиса ходит первой,
то это максимальный выигрыш для нее. Если число положительное, то она
побеждает, отрицательное - проигрывает, ноль - ничья. Также нужно обработать
случаи, когда в массиве меньше 3 элементов, чтобы при расчетах не выйти за
пределы массива. Если размер массива равен 1, то это число точно берет Алиса
и на основе его значения ищется ответ с помощью функции getAns(). Если есть
2 значения, то Алиса может взять только первое, а второе оставить Бобу, или
взять оба числа. Выбираем max(stoneValue[0] - stoneValue[1],
stoneValue[0] + stoneValue[1]).

Дальше смотрим уже общий случай при размере не меньше 3. Сохраним в e1, e2 и
e3 3 последних числа из stoneValue в порядке слева направо. Из массива dp
нам достаточно знать 3 последних значения, поэтому сразу определим их. Цикл
идет от 4-го с конца значения (n - 4), поэтому расчет для него:
- dp3 - значение dp, если игрок 1 берет 3 числа. При i = n - 4 игрок 2
  играет на массиве из одного элемента e3, который и составит его выигрыш.
  То есть dp3 = e3.
- dp2 - значение dp, если игрок 1 берет 2 числа, тогда игрок 2 играет на
  массиве из элементов e2 и e3. Аналогично ранее рассмотренной ситуации для
  случая массива из 2 чисел dp2 = max(e2 - e3, e2 + e3)
- dp1 - значение dp, если игрок 1 берет 1 число, тогда игрок 2 играет на
  массиве из элементов e1, e2, e3.
  dp1 = max(e1 - dp2, e1 + e2 - dp3, e1 + e2 + e3)
В dp1 и будет сохранено конечное значение dp[0], которое нужно для ответа.

Также заведем переменные val1, val2 и val3, чтобы считать суммы элементов
без частого обращения к массиву. val1, val2, val3 = e1, e1 + e2, e1 + e2 + e3.

На каждой итерации цикла сначала сохраняем в переменную val значение
stoneValue[i] и обновляем val1, val2 и val3 по правилу
val1, val2, val3 = val, val1 + val, val2 + val. Находим текущее значение dp
как max(val1 - dp1, val2 - dp2, val3 - dp3) и обновляем значения как
dp1, dp2, dp3 = dp, dp1, dp2.

Лучшее решение: 161 ms (98.02%), 23.96 Mb (67.04%)
#dynamic_programming #game_theory #minimax
"""


class Solution:

    def getAns(self, val: int) -> str:
        if val > 0:
            return 'Alice'
        if val == 0:
            return 'Tie'
        return 'Bob'

    def stoneGameIII(self, stoneValue: list[int]) -> str:
        n = len(stoneValue)
        if n == 1:
            return self.getAns(stoneValue[0])
        if n == 2:
            e1, e2 = stoneValue
            val = max(e1 - e2, e1 + e2)
            return self.getAns(val)
        e1, e2, e3 = stoneValue[n - 3], stoneValue[n - 2], stoneValue[n - 1]
        dp3 = e3
        dp2 = max(e2 - e3, e2 + e3)
        dp1 = max(e1 - dp2, e1 + e2 - e3, e1 + e2 + e3)
        val1, val2, val3 = e1, e1 + e2, e1 + e2 + e3
        for l in range(n - 4, -1, -1):
            val = stoneValue[l]
            val1, val2, val3 = val, val1 + val, val2 + val
            dp = max(
                val1 - dp1,
                val2 - dp2,
                val3 - dp3,
            )
            dp1, dp2, dp3 = dp, dp1, dp2
        return self.getAns(dp1)
