"""
Minimum Insertions to Balance a Parentheses String.

Дана строка s, состоящая из открывающих и закрывающих скобок. Строка считается
сбалансированной, если для каждой открывающей скобки правее есть две подряд
идущие закрывающие скобки. Можно добавлять любой тип скобок в произвольное
место строки. Найти минимальное количество вставок, чтобы сделать строку
сбалансированной. Другими словами, нужно привести s к ПСП, где закрывающей
скобкой считается '))'.

Так как это вопрос ПСП, то сразу заведем переменную cnt для поддержания
текущего баланса открытых и закрытых скобок. Также важно контролировать кол-во
подряд идущих закрывающих скобок, чтобы грамотно управлять счетчиком и
добавлять недостающие скобки при необходимости. За это отвечает переменная
close, которая показывает четность общего числа закрывающих скобок (0 - четное,
1 - нечетное). Идем по строке слева направо. Открывающая скобка увеличивает
счетчик на 1. Если перед этим было нечетное число закрывающих скобок, то мы
должны добавить еще одну закрывающую скобку. То есть, увеличиваем общий ответ
на 1 и переводим close на 0. Каждая закрывающая скобка меняет общую четность
(реализовано через исключающее ИЛИ с единицей), но на значение счетчика влияет
только первая из двух подряд идущих закрывающих скобок. Эта скобка всегда будет
нечетной в общем числе закрывающих скобок, поэтому можно вычитать из cnt
значение close без дополнительных ветвлений if-else. Если счетчик стал меньше
0, то нужно добавить открывающую скобку, то есть увеличить ответ на 1. После
цикла прибавляем к ans значение счетчика, умноженное на 2, так как для каждой
открытой скобки нужны 2 закрывающие. Также прибавляем значение close, так как
если close = 1, то мы уже учли закрытие в значении счетчика, но не добавили
недостающую закрывающую скобку.

Лучшее решение: 51 ms (95.09%) 19.79 Mb (88.77%)
#bracket_sequences #string #greedy
"""


class Solution:

    def minInsertions(self, s: str) -> int:
        ans = 0
        cnt = 0
        close = 0
        for e in s:
            if e == '(':
                cnt += 1
                if close:
                    ans += 1
                    close = 0
            else:
                close ^= 1
                cnt -= close
                if cnt < 0:
                    ans += 1
                    cnt = 0
        ans += cnt * 2 + close
        return ans
