"""
Evaluate the Bracket Pairs of a String.

Дана строка s, состоящая из строчных латинских букв и скобок '()', а также
двумерный массив knowledge, knowledge[i] = [key[i], value[i]]. Необходимо
заменить части строки, заключенные между скобками, на соответствующие значения
из массива knowledge, если они там есть, или поставить '?'. Например,
s = '(name)is(age)yearsold', knowledge = [['name', 'bob'], ['age', 'two']],
получаем ans = 'bobistwoyearsold'.

Сначала переведем массив knowledge в словарь, чтобы быстро находить значения
по ключам. Далее идея состоит в том, чтобы двигаться от текущего блока внутри
скобок к следующему, добавляя в ответ значение ключа внутри скобок и часть
строки между блоками скобок. Для этого находим позицию открывающей скобки
start. Если ее нет, то в качестве ответа возвращаем исходную строку, иначе -
кладем в ответ s[:start]. Затем в цикле повторяем следующие действия:
- находим позицию закрывающей скобки end;
- сохраняем ключ key как s[start + 1:end];
- добавляем в ответ d[key] или -1, если ключа нет;
- находим позицию следующей открывающей скобки;
- если start стал равен -1, то кладем в ответ всю оставшуюся строку от end + 1 
  до конца и выходим из цикла;
- если start не равен -1, то в ответ кладем часть строки между блоками из
  скобок, то есть s[end + 1:start].
В конце объединяем ответ в одну строку.

Лучшее решение: 39 ms (89.72%), 51.25 Mb (97.82%)
#string #array #hash_table
"""


class Solution:

    def evaluate(self, s: str, knowledge: list[list[str]]) -> str:
        ans = []
        d = {e[0]: e[1] for e in knowledge}
        start = s.find('(')
        if start == -1:
            return s
        ans.append(s[:start])
        while True:
            end = s.find(')', start + 1)
            key = s[start + 1:end]
            ans.append(d.get(key, '?'))
            start = s.find('(', end + 1)
            if start == -1:
                ans.append(s[end + 1:])
                break
            ans.append(s[end + 1:start])
        return ''.join(ans)
