"""
Maximum Element After Decreasing and Rearranging.

Дан массив целых положительных чисел arr. К нему применяются 2 операции:
- уменьшить элемент до любого положительного числа;
- переставить элементы в любом порядке.
Массив после применения любого количества таких операций должен удовлетворять
двум условиям:
- первый элемент равен единице;
- любые два соседних элемента отличаются друг от друга не более чем на 1.
Найти значение наибольшего элемента в полученном массиве.

Сортируем массив по возрастанию и устанавливаем arr[0] на 1. Далее идем циклом
по всем элементам массива. Для каждого уникального значения num считаем его
частоту freq. Теперь нужно определить, каким станет это значение в измененном
массиве. Так как мы можем только уменьшать числа, то поставить что-то большее
чем num на текущую позицию нельзя. При этом нужно учитывать, что соседи
отличаются не более чем на 1. Например, arr = [1, 5, 5]. На позиции 2 не может
быть числа больше 5, но и 5 стоять не может, так как на индексе 1 наибольшим
числом будет 2, на индексе 2 - 3. Тут пригодится значение частоты и предыдущее
значение ответа. Так как мы ищем максимум, то наибольшим значением в такой
ситуации окажется ans + freq, что позволяет получить разницу в единицу между
числами. Таким образом, после каждого уникального числа обновляем ответ на
max(ans + freq, num). Массив отсортирован, поэтому ответ обновляется жадно.

Лучшее решение: 12 ms (92.20%), 28.22 Mb (56.03%)
#array #greedy #sorting
"""


class Solution:

    def maximumElementAfterDecrementingAndRearranging3(
        self,
        arr: list[int],
    ) -> int:
        arr.sort()
        arr[0] = 1
        ans = 0
        freq = 0
        prev = 1
        for i in range(len(arr)):
            if arr[i] == prev:
                freq += 1
            else:
                ans += freq
                if prev < ans:
                    ans = prev
                freq = 1
                prev = arr[i]
        ans += freq
        if prev < ans:
            ans = prev
        return ans
