"""
Minimum Score of a Path Between Two Cities.

Дано целое число n, задающее количество городов, которые пронумерованы числами
от 1 до n, а также массив roads, описывающий дороги между этими городами.
roads[i] = [a, b, distance], то есть существует дорога между городами a и b
длиной distance. Граф является неориентированным. В качестве метрики пути
между городами используется минимальная длина дороги на этом пути. При этом
допускается неоднократный проход по любой дороге, то есть можно дойти до
некоторого города, вернуться в точку отправления и пойти в другую сторону.
Необходимо найти минимальную метрику пути между городами 1 и n. Гарантируется,
что такой путь существует.

Так как граф является неориентированным и есть возможность посещать одни и те
же города несколько раз, то достаточно определить наименьшую длину дороги
в компоненте связности, включающей города 1 и n. Для этого для каждого города
можно составить список смежных вершин и двигаться из вершины 1, пока в очереди
есть еще непосещенные вершины, в процессе обновляя ответ. Такой подходт
затратен и по времени (создание словаря смежных вершин, проход по ключам
словаря с изменением переменной ответа на каждом шаге, поддержание очереди),
и по памяти (в словаре нужно хранить и смежную вершину, и расстояние до нее,
также нужно хранить очередь).

Подход с использованием системы непересекающихся множеств эффективнее. Для
этого создадим 2 массива длиной n + 1, centers и minDist. centers[i] - центр
множества, в которое входит i-й город. minDist[i] - наименьшая длина дороги
для множества с центром в i-м городе. Изначально каждый город изолирован,
то есть centers[i] = i, а минимальная длина дороги равна бесконечности. Идем
по массиву дорог и выполняем следующие действия:
- Определяем концы текущей дороги как start и end.
- От каждого из концов движемся к центру множеств, в которые они входят. То
  есть идем по массиву centers, пока не надйем такое i, что centers[i] == i.
- Цепляем центр с большим номером к центру с меньшим номером, т.е. обновляем
  ссылку в массиве centers. Для общего центра обновляем значение минимальной
  длины дороги. Это будет минимум из значений для двух связываемых центров
  и длины текущей дороги.
Ответ на задачу будет лежать в minDist[1]. Город 1 точно будет центром
некоторого множества, так как прицепка идет всегда к городу с меньшим номером.

Лучшее решение: 46 ms (100%), 51.53 Mb(96.82%)
#union_find #graph_theory
"""


class Solution:

    def minScoreUnion(self, n: int, roads: list[list[int]]) -> int:
        centers = list(range(n + 1))
        minDist = [float('inf')] * (n + 1)
        for road in roads:
            start, end, dist = road
            while centers[start] != start:
                start = centers[start]
            while centers[end] != end:
                end = centers[end]
            if start <= end:
                centers[end] = start
                minDist[start] = min(minDist[start], minDist[end], dist)
            else:
                centers[start] = end
                minDist[end] = min(minDist[start], minDist[end], dist)
        return minDist[1]
