"""
Left and Right Sum Differences.

Дан массив целых положительных чисел nums. Для каждого индекса в этом массиве
необходимо найти значение abs(leftsum[i] - rightsum[i]), где leftsum[i] - сумма
элементов до текущего индекса, rightsum[i] - сумма чисел на позициях после
текущего индекса. Значение на индексе i не включается ни в одну из сумм.

Будем использовать 2 переменные для хранения накопленных значений сумма слева
и справа. Изначально левая сумма равна 0, правая - сумме всех элементов
массива. Проходимся по всем элементам массива. На каждом шаге цикла сначала
уменьшаем правую сумму на текущее значение, так как оно не участвует в
рассчетах. Считаем модуль разности между левой и правой суммой и заносим его
в ответ. Затем увеличиваем левую сумму на текущее число.

Лучшее решение: 0 ms (100 %), 19.34 Mb (86.97%)
#array #prefix_sum
"""


class Solution:

    def leftRightDifference(self, nums: list[int]) -> list[int]:
        right = sum(nums)
        left = 0
        n = len(nums)
        ans = [0] * n
        for i in range(n):
            right -= nums[i]
            ans[i] = abs(right - left)
            left += nums[i]
        return ans
