"""
Longest Subsequence With Non-Zero Bitwise XOR.

Дан массив целых неотрицательных чисел nums. Найти длину наибольшей
последовательности чисел, для которой XOR ее элементов не равен нулю. Числа
последовательности могут располагаться в любом месте массива, но их
относительный порядок сохраняется.

Идея в том, что если XOR всего массива равен 0, то достаточно убрать одно
любое положительное число, чтобы получить ненулевое значение. Если все
элементы равны 0, то XOR любой последовательности будет 0. Таким образом,
для ответа находим XOR всего массива (xor) и определяем, есть ли в массиве
хотя бы один положительный элемент (nonZero). Если xor и так положительный,
то возвращаем длину массива как ответ. Если xor равен 0, но nonZero = True,
то возвращаем len(nums) - 1. Если ненулевых элементов нет, то 0 будет ответом.

Лучшее решение: 17 ms (95.16%), 33.34 Mb (37.90%)
#bit_manipulation #array
"""


class Solution:

    def longestSubsequence(self, nums: list[int]) -> int:
        n = len(nums)
        nonZero = any(num for num in nums)
        xor = 0
        for num in nums:
            xor ^= num
        if xor:
            return n
        if nonZero:
            return n - 1
        return 0
        