"""
Maximize Sum of Squares of Digits.

Даны два положительных целых числа num и sum. Положительное целое число
считается хорошим, если в нем ровно num цифр, а их сумма равна sum. Скор
такого числа определяется как сумма квадратов его цифр. Найти наибольшее
хорошее число, которое дает максильно возможный скор. Если такого числа нет,
то вывести пустую строку.

Каждая цифра находится в диапазоне [0, 9], значит сумма цифр не может
превышать 9 * num. Если sum > 9 * num, то хороших чисел нет.

Для максимизации суммы квадратов нужно использовать все доступное количество
цифр 9, а для получения наибольшего числа - поместить эти девятки на старшие
разряды. Всего можно использовать sum // 9 девяток. За ними может находиться
sum % 9, если девятки не заполнили все доступные позиции. Если и после этого
остались пустые младшие разряды, то на них ставим нули.

Лучшее решение: 0 ms (100.00%), 20.84 Mb (90.55%)
#math #greedy
"""


class Solution:

    def maxSumOfSquares(self, num: int, sum: int) -> str:
        if sum > 9 * num:
            return ''
        nineCnt = sum // 9
        nonNineDigit = sum % 9
        return (
            '9' * nineCnt
            + str(nonNineDigit) * min(1, num - nineCnt)
            + '0' * max(0, num - nineCnt - 1)
        )
