"""
Maximum Alternating Sum of Squares.

Дан массив целых чисел nums. Скор массива считается как
score = nums[0] ** 2 - nums[1] ** 2 + nums[2] ** 2 - nums[3] ** 2 + ....
Необходимо найти максимальный скор массива при условии, что числа можно
переставить любым образом.

Так как нужно максимизировать значение, то на четных индексах должны стоять
наибольшие по модулю числа, на нечетных - оставшиеся. Количество чисел на
нечетных позициях равно len(nums) // 2 при любой четности длины. Возводим
каждое число в исходном массиве в квадрат и сортируем массив. mid - кол-во
нечетных чисел и индекс первого числа на четной позиции. Поэтому суммируем
все квадраты чисел от mid до конца и вычитаем сумму всех значений левее mid.

Лучшее решение: 139 ms (95.05%), 32.84 Mb (30.77%)
#sorting #greedy #array
"""


class Solution:

    def maxAlternatingSum5(self, nums: list[int]) -> int:
        nums = [e * e for e in nums]
        nums.sort()
        mid = len(nums) // 2
        return sum(nums[mid:]) - sum(nums[:mid])
