"""
Apply Operations on Array to Maximize Sum of Squares.

Дан массив целых положительных чисел nums и целое число k. Можно применить
следующую операцию к массиву любое количество раз: выбрать индексы i и j
и заменить числа на них на nums[i] & nums[j] и nums[i] | nums[j]. Затем
необходимо взять k элементов из измененного массива и посчитать сумму их
квадратов. Найти максимальное значение суммы, которое можно получить.

Решение строится на том, что разрешенная операция по сути просто перемещает
биты от одного числа к другому, при этом общее количество бит на k-й позиции
среди всех чисел не меняется. Также заметим, что для максимизации суммы
выгоднее наращивать большие числа, а не размазывать доступные биты по всем
значениям. Тогда алгоритм сводится к 2-м основным шагам:
1. Посчитать кол-во бит на каждой позиции среди всех чисел. Для этого
   используем массив d, длина которого равна битовой длине самого большого
   числа в массиве.
2. Получить набор максимальных чисел. Создадим массив res размера k, так как
   все остальные числа для ответа не нужны. Заполним его нулями, потому что
   чисел может получиться меньше k, точнее часть чисел просто обнулится при
   перераспределении бит. Затем идем в цикле от старшего бита к младшему и
   раздаем текущий i-й бит первым d[i] числам в массиве res. Например, i = 3,
   d[i] = 2, то есть на 3-й позиции есть 2 бита. Раздаем их 2-м первым числам,
   то есть прибавляем к каждому из них 2 ** i = 2 ** 3 = 8.
После этого возводим полученные числа в квадрат и находим их сумму.

Лучшее решение: 1212 ms (92.16%), 32.11 MB (35.29%)
#bit_manipulation #greedy
"""


class Solution:

    def maxSum(self, nums: list[int], k: int) -> int:
        dLen = max(nums).bit_length()
        d = [0] * dLen
        for num in nums:
            pos = 0
            while num:
                if num & 1:
                    d[pos] += 1
                num >>= 1
                pos += 1
        mod = 10 ** 9 + 7
        res = [0] * k
        for i in range(dLen - 1, -1, -1):
            for j in range(min(d[i], k)):
                res[j] += 1 << i
        ans = 0
        for num in res:
            ans = (ans + (num * num) % mod) % mod
        return ans
