"""
Number of Closed Islands.

Дан двумерный массив grid, состоящий из нулей и единиц. 0 - участок суши, 1
- участок воды. Островом считается связная последовательность нулей, связь
идет по четырем направлениям, исключая диагонали. Остров называется закрытым,
если по каждому из четрых направлений он окружен водой. Зона вокруг grid водой
не считается. Найти количество закрытых островов.

Идея состоит в том, чтобы найти все острова в массиве и посчитать количество
тех, которые не касаются краев поля. Для этого воспользуемся идеями поиска
в глубину и ширину. Проходим по полю сверху вних и слева направо. Если текущий
элемент равен 0, запускаем цикл поиска острова. Создаем переменную isClosed,
которая отвечает за то, является остров закрытым или нет, и изначально равна 1,
а также стек q индексов на проверку, куда кладем текущую пару (i, j). Значение
grid[i][j] помечаем числом 2, это просто пометка, что клетка посещена. Пока
стек не пуст, забираем последний элемент из него, то есть делаем некоторую
имитацию поиска в глубину. Если клетка находится на границе поля, то меняем
isClosed на 0, так как остров уже не будет закрытым. Затем смотрим на соседей
по 4 направленияем. Если сосед находится в пределах поля и его значение равно
0, то добавляем его индексы в стек, а само значение меняем на 2, что
гарантирует недобавление этой клетки в стек повторно. Когда все клетки острова
помечены, прибавляем к ответу значение isClosed.

Лучшее решение: 14 ms (79.73%), 19.58 Mb (94.59%)
#matrix #dfs #bfs
"""


class Solution:

    def closedIsland(self, grid: list[list[int]]) -> int:
        ans = 0
        n, m = len(grid), len(grid[0])
        dx = [-1, 0, 1, 0]
        dy = [0, 1, 0, -1]
        for i in range(n):
            for j in range(m):
                if grid[i][j] == 0:
                    isClosed = 1
                    q = [(i, j)]
                    grid[i][j] = 2
                    while q:
                        x, y = q.pop()
                        if x in [0, n - 1] or y in [0, m - 1]:
                            isClosed = 0
                        for k in range(4):
                            newX, newY = x + dx[k], y + dy[k]
                            if (
                                0 <= newX < n
                                and 0 <= newY < m
                                and grid[newX][newY] == 0
                            ):
                                q.append((newX, newY))
                                grid[newX][newY] = 2
                    ans += isClosed
        return ans
