"""
Remove Covered Intervals.

Дан массив intervals, где intervals[i] = [l, r], левая и правая границы i-го
интервала. Необходимо найти кол-во интервалов, которые не входят полностью
в какой-либо другой интервал.

Сортируем массив intervals по возрастанию левой границы, при совпадении
значений - по убыванию правой границы. Также заводим переменные right и cnt,
right - наибольшее значение правой границы среди уже обработанных отрезков,
cnt - кол-во отрезков, не покрытых полностью другими отрезками. Идем
последовательно по массиву. Если конец текущего отрезка больше right, то он
заведомо не покрывается другим отрезком. Это верно, потому что у всех
предыдущих отрезков начало лежит до начала текущего отрезка или совпадает с
ним, а правая граница не превышает right, значит текущий отрезок правым концом
точно будет выходить за пределы любого из этих отрезков. У последующих отрезков
левая граница будет не мнеьше левой границы текущего отрезка, поэтому они
также будет либо выпирать правым концом, либо полностью покрываться, если
их правая граница меньше right. То есть, при intervals[i][1] > right счетчик
увеличивается на 1 и происходит обновление right на intervals[i][1]. Ответом
будет значение счетчика.

Лучшее решение: 3 ms (77.50%), 19.55 Mb (80.88%) 
#array #sorting
"""


class Solution:

    def removeCoveredIntervals(self, intervals: list[list[int]]) -> int:
        intervals.sort(key=lambda e: [e[0], -e[1]])
        right = float('-inf')
        cnt = 0
        for interval in intervals:
            end = interval[1]
            if end > right:
                cnt += 1
                right = end
        return cnt 
