"""
Sequential Digits.

Найти все числа на отрезке [low, high], в которых каждая следующая цифра ровно
на 1 больше предыдущей и вывести их в порядке возрастания.

Верхняя граница не превосходит 10 ** 9, значит в числе не больше 9 цифр. Во
внешнем цикле можно перебрать все варианты первой цифры, а во внутреннем
последовательно умножать текущее число на 10 и добавлять цифры от i + 1 до 9
в последний разряд. Если новое число входит в отрезок, то добавлять его в
ответ. Затем отсортировать уже полученный массив. Сложность будет O(1), т.к.
всего 36 вариантов чисел для проверки.

Можно несколько сократить этот перебор. Во-первых, нет смысла смотреть числа,
в котороых количество разрядов меньше, чем в low. Во-вторых, каждое следующее
число с одинаковым количеством разрядов k в отсортированным массиве можно
получить прибавлением числа, состоящим из k единиц. То есть можно обойтись
без сортировки. С учетом этого, сначала определяем минимальное число разрядов
minNumLen, на его основе считаем наименьшее число с последовательными цифрами
minNum и добавку add для перехода к следующему числу. Также сохраняем
переменную digit, это следующая последовательная цифра в minNum. Внешним
циклом идем, пока minNum не превышает high. Во внутреннем цикле делаем
9 - digit + 2 шага, чтобы проверяемые числа удоавлетворяли условию по набору
цифр, а также добавляем раннюю остановку, если текущее число стало больше high.
Числа в границах отрезка [low, high] кладем в ответ. После этого умножаем
minNum на 10 и добавляем digit, add тоже умножаем на 10 и прибавляем 1,
digit увеличиваем на 1. Ответ уже получается отсортирован.

На большом количество тестов второй вариант даем выигрыш по времени.

Лучшее решение: 0 ms (100%), 19.28 Mb (64.31%)
#enumeration #simulation
"""


class Solution:

    def sequentialDigits(self, low: int, high: int) -> list[int]:
        ans = []
        for i in range(1, 10):
            num = i
            for j in range(i + 1, 10):
                num = num * 10 + j
                if low <= num <= high:
                    ans.append(num)
        return sorted(ans)

    def sequentialDigits2(self, low: int, high: int) -> list[int]:
        minNumLen = len(str(low))
        minNum = 0
        for i in range(1, minNumLen + 1):
            minNum = minNum * 10 + i
        add = 0
        for _ in range(minNumLen):
            add = add * 10 + 1
        ans = []
        digit = minNumLen + 1
        while minNum <= high:
            curr = minNum
            for _ in range(9 - digit + 2):
                if curr > high:
                    break
                if curr >= low:
                    ans.append(curr)
                curr += add
            minNum = minNum * 10 + digit
            add = add * 10 + 1
            digit += 1
        return ans
