"""
Check if There Is a Valid Parentheses String Path.

Дана матрица, каждый элемент в которой - открывающая или закрывающая скобка.
Необходимо выяснить, есть ли путь из левого верхнего угла в правый нижний,
который представляет собой правильную скобочную последовательность (ПСП).
Двигаться можно только вниз или вправо.

Используем динамическое программирование. dp[i][j] - множество вариантов
баланса скобок для потенциальных ПСП, которые остановились в данной ячейке.
То есть, это все варианты неотрицательной разности числа открытых и закрытых
скобок, которые позволяют считать последовательность правильной на данный
момент. Мы можем двигаться только вниз или вправо, поэтому для поиска таких
вариантов смотрим на ячейки dp[i - 1][j] (движение вниз к текущей ячейке)
и dp[i][j - 1] (движение вправо). Если grid[i][j] == '(', то к каждому
уникальному варианту из соседних клеток добавляем 1,
dp[i][j] = set(e + 1 for e in dp[i - 1][j] | dp[i][j - 1]). Если текущая
скобка - закрывающая, то из имеющихся вариантов нужно вычесть 1 и оставить
только неотрицательные значения, так как в иной ситуации ПСП уже не получить.
dp[i][j] = set(e - 1 for e in dp[i - 1][j] | dp[i][j - 1] if e - 1 >= 0).

Так как мы двигаемся только вниз или вправо, то можно не использовать полную
матрицу, а ограничиться только одной строкой, которую будем перезаписывать на
каждом шаге. При таком подходе соседями будут ячейка слева, dp[j - 1], и
текущая ячейка, dp[j], которая до перезаписи соответствует верхнему соседу.
Массив dp сделаем на 1 больше, чем количество столбцов матрицы, чтобы
обрабатывать первые элементы каждой строки в общем порядке. Также при
инициализации dp установим все значения как пустые множества, а dp[1] будет
равно {0} для корректной обработки первой строки. Затем идем по всем клеткам
матрицы и действуем по описанному ранее принципу. В качестве ответа возвращаем
True только в том случае, если после цикла среди вариантов в dp[m] будет 0,
что и соответствует ПСП.

Лучшее решение: 275 ms (61.00%), 20.74 Mb (100.00%)
#dynamic_programming #array #matrix
"""


class Solution:

    def hasValidPath(self, grid: list[list[str]]) -> bool:
        n, m = len(grid), len(grid[0])
        if grid[n - 1][m - 1] == '(':
            return False
        dp: list[set[int]] = [set() for _ in range(m + 1)]
        dp[1] = {0}
        for i in range(n):
            for j in range(1, m + 1):
                if grid[i][j - 1] == '(':
                    dp[j] = {e + 1 for e in dp[j - 1] | dp[j]}
                else:
                    dp[j] = {e - 1 for e in dp[j - 1] | dp[j] if e - 1 >= 0}
        return any(e == 0 for e in dp[m])
