"""
Minimum Operations to Sort a String.

Дана строка s, состоящая из строчных латинских букв. За одну операцию можно
выбрать подстроку размера 1 <= len(substring) < len(s) и отсортировать ее
в алфавитном порядке. Найти минимальное количество операций, чтобы
отсортировать всю строку в порядке возрастания. Если сортировка невозможна,
то вывести -1.

Если строка уже отсортирована, то никакие операции не нужны. Поэтому сначала
выясняем, выполняется ли условие, что каждый следующий символ не меньше своего
соседа слева. Если это так, то возвращаем 0.

Далее логика строится на том, что для минимизации числа операция имеет смысл
сортировать подстроки как можно большей длины за одну операцию. То есть берем
подстроку размера len(s) - 1, опуская первый или последний символ строки s,
и сортируем ее. Если на левом краю стоит наименьший элемент строки или на
конце стоит наибольший символ, то одной операции достаточно, так как при ее
выполнении можно установить второй экстремум на место и отсортировать остальные
буквы. Например, 'acdb'. Наименьший символ 'a' стоит в начале, значит сортируем
подстроку 'cdb' и получаем 'abcd' за одну операцию. Если s = 'bcad', то просто
сортируем 'bca' для получения ответа. Если экстремумы не на своих позициях,
а длина строки равна 2, то сортировка невозможна, так как для перестановки
букв нужно взять всю строку, что запрещено по условию. А в общем случае нужны
2 операции, чтобы поставить минимум и максимум на свои позиции. Но есть еще
одна ситуация, которую нужно выделить отдельно. Пусть s = 'cba', тогда цепочка
будет выглядеть так: 'cba' -> 'bca' -> 'bac' -> 'abc'. В случае, когда максимум
стоит в начале строки, а минимум - в конце, нужно 3 операции, так как за первую
операцию мы проталкиваем максимум на позицию n - 2, за вторую - устанавливаем
максимум в конец и сдвигаем минимум на индекс 1, за третью - ставим минимум в
начало. Это верно в том случае, если в середине строки нет других вхождений
наибольшей или наименьшей буквы. В обратном случае уже за первую операцию мы
установим один из экстремумов и всего понадобится 2 операции.

Лучшее решение: 84 ms (85.61%), 19.80 Mb (96.97%)
#string
"""


class Solution:

    def minOperations(self, s: str) -> int:
        n = len(s)
        if all(s[i] >= s[i - 1] for i in range(1, n)):
            return 0
        minL, maxL = min(s), max(s)
        minCnt, maxCnt = s.count(minL), s.count(maxL)
        if s[0] == minL or s[n - 1] == maxL:
            return 1
        if n == 2:
            return -1
        if s[0] == maxL and s[n - 1] == minL and minCnt == maxCnt == 1:
            return 3
        return 2
