"""
Maximize Active Section with Trade I.

Дана строка s, состоящая из нулей и единиц. Можно выполнить не более одной
операции обмена, чтобы максимизировать общее количество единиц. Операция
обмена состоит из 2-х этапов:
- Последовательный блок из единиц, заключенный между блоками из нулей,
  сам становится блоком нулей.
- Полученный блок из нулей заменяется на блок единиц такой же длины.
При этом считается, что строка s находится между двумя единицами, которые не
учитываются в ответе. Найти максимальное количество единиц, которое можно
получить после операции обмена.

В единицы можно преобразовать 2 подряд идущих блока из нулей. Между ними точно
есть блок единиц, а по краям есть либо блоки единиц, либо единицы, окружающие
строку. Следовтельно задача сводится к поиску двух таких блоков с наибольшей
общей длиной.

Заведем переменные:
- ans - int, значение ответа;
- prev - bool, индикатор предыдущего значения; если prev = 1, то перед текущим
  символом была единица;
- prevCnt - int, длина первого блока из нулей;
- currCnt - int, длина второго блока из нулей;
- maxAdd - int, наибольшая длина двух подряд идущих блоков из нулей.

Идем последовательно по строке. Если текущее значение num == '1', то точно
увеличиваем ответ на 1, так как все исходные единицы должны в него включаться.
Если при этом prev = 0, то есть перед текущей единицей был ноль, то на данном
этапе закрылся блок нулей. Если значение prevCnt != 0, то закрылся уже второй
блок, значит нужно найти сумму их длин, prevCnt + currCnt, и обновить maxAdd
при необходимости. В prevCnt кладем currCnt и зануляем currCnt. Устанавливаем
prev на 1. Если num == '0', то ставим prev на 0 и увеличиваем currCnt. После
выхода из цикла смотрим на prevCnt и currCnt. Если они оба не равны 0, то
сравниваем их сумму с maxAdd и обновляем maxAdd при необходимости. Такая
проверка нужна для ситуаций, когда после последнего блока нулей нет единиц
в самой строке s.

Лучшее решение: 384 ms (98.13%), 20.53 Mb (87.85%)
#string #enumeration
"""


class Solution:

    def maxActiveSectionsAfterTrade(self, s: str) -> int:
        ans = 0
        prev = 1
        prevCnt = 0
        currCnt = 0
        maxAdd = 0
        for num in s:
            if num == '1':
                ans += 1
                if not prev:
                    if prevCnt:
                        trade = prevCnt + currCnt
                        if trade > maxAdd:
                            maxAdd = trade
                    prevCnt, currCnt = currCnt, 0
                prev = 1
            else:
                prev = 0
                currCnt += 1
        if prevCnt and currCnt:
            trade = prevCnt + currCnt
            if trade > maxAdd:
                maxAdd = trade
        return ans + maxAdd
