"""
Minimum Number of Pushes to Type Word I.

Дана строка word, содержащая только строчные латинские буквы, каждая из которых
используется не более 1 раза. Предположим, что есть кнопочный телефон, где
каждой цифре от 2 до 9 можно поставить в соответствие любую комбинацию букв.
Для набора первой буквы комбинации нужно одно нажатие, для второй буквы - два
нажатия, и т.д. Необходимо найти минимальное количество нажатий кнопок
телефона при некотором разделении букв по кнопкам, чтобы набрать строку word.

Так как каждая буква встечается не более 1 раза и нужно найти минимальное
число нажатий, то имеет смысл распределить буквы между кнопками как можно
равномернее. То есть на каждую кнопку должны приходиться комбинации, которые
отличаются друг от друга по длине не более чем на 1. Найдем целую часть и
остаток от деления длины строки word на 8 (число кнопок), это переменные div
и mod. div показывает минимальную длину комбинации на каждой кнопке, mod -
кол-во кнопок, с длиной комбинации div + 1. Если минимальная длина комбинации
равна div, то точно будет совершено 8 * 1 + 8 * 2 + ... + 8 * div нажатий,
то есть 8 * (sum(1...div)). Оставшиеся mod букв уже будут иметь номер div + 1
в комбинации, поэтому для их набора нужно mod * (div + 1) нажатий. Сумма этих
значений и есть ответ.

Лучшее решение: 0 ms (100%), 19.35 Mb (16.35%)
#math #string
"""


class Solution:

    def minimumPushes(self, word: str) -> int:
        div, mod = divmod(len(word), 8)
        return 8 * sum(range(div + 1)) + mod * (div + 1)
