"""
Maximum Length Substring With Two Occurrences.

Дана строка s, состоящая из строчных латинских букв. Найти наибольшую длину
подстроки, в которой каждый символ повторяется не более двух раз.

Используем метод скользящего окна переменной длины. Заведем словарь c для
подсчета частот символов, а также переменные curr и left, текущая длина
подстроки и положение левого указателя. Идем по строке слева направо и
увеличиваем частоту очередного символа в словаре. Если частота стала больше
двух, то сравниваем ответ со значением curr - 1 (игнорируем избыточное
повторение) и при необходимости обновляем его. Затем сдвигаем левый указатель
и удаляем элементы под ним, пока частота текущего символа не станет равной
двум. Также уменьшаем длину подстроки curr в процессе. Возвращаем максимум
из ans и curr, так как нужная подстрока может стоять в конце исходной.

Лучшее решение: 0 ms (100%), 19.25 Mb (60.10%)
#sliding_window #hash_table #string
"""


class Solution:

    def maximumLengthSubstring(self, s: str) -> int:
        c = {}
        ans = float('-inf')
        curr = 0
        left = 0
        for e in s:
            c[e] = c.get(e, 0) + 1
            curr += 1
            if c[e] > 2:
                if curr - 1 > ans:
                    ans = curr - 1
                while c[e] > 2:
                    letter = s[left]
                    c[letter] -= 1
                    curr -= 1
                    left += 1
        return max(ans, curr)
