"""
Generate Parentheses.

Дано целое число n, задающее количество пар скобок. Необходимо сгенерировать
все правильные скобочные последовательности из этого числа скобок.
Испоьзуются только круглые скобки.

Создаем 2 параметра класса: ans - массив, куда будут заноситься полученные
ответы, n - общая длина последовательности, равная 2 * исходное число n.

Аргументы функции rec:
- now_open - кол-во скобок, которые открыты в данный момент.
- open_cnt - общее кол-во скобок, которые открыты сейчас или были открыты
  и закрыты ранее.
- curr - текущая последовательность.
- curr_len - длина текущей последовательности.

Если длина текущей последовательности равна предельной длине, то заносим
в ответ полученный результат. В ином случае ставим следующую скобку. Если
общее количество открытых скобок меньше половины предельной длины, то можно
поставить открывающую скобку, увеличив счетчики now_open и open_cnt. Если
на данном этапе открыты какие-то скобки (now_open > 0), то можно поставить
и закрывающую скобку, уменьшив now_open. Таким образом, когда рекурсия доходит
до предельной длины, то в curr точно правильная последовательность и проверка
не требуется.

В версии 2026 года массив ответа является внешней переменной, к которой идет
обращение внутри рекурсии. Рекурсия внутри использует только переменные кол-ва
поставленных открывающих (bOpen) и закрывающих скобок (bClose). Открывающую
скобку можно поставить, если их число меньше n, т.е. bOpen < n. Закрывающую
скобку можно поставить, если их меньше, чем открывающих, bClose < bOpen.
Текущее состояние последовательности скобок задается массивом curr, а не
строкой, поэтому после каждого выхода из рекурсии нужно удалять добавленную
ранее скобку, чтобы корректно перейти к следующему шагу.

При 10 ** 4 запусках при n = 8 версия от 2025 года работает быстрее, 10.968
сек против 13.886 сек.

Лучшее решение: 0 ms (100.00%), 17.86 Mb (100.00%) <- 2025
                0 ms (100.00%), 19.49 Mb (36.93%) <- 2026
#bracket_sequences #backtracking #recursion
"""


class Solution:

    def rec(
        self,
        now_open: int = 0,
        open_cnt: int = 0,
        curr: str = '',
        curr_len: int = 0,
    ):
        if curr_len == self.n:
            self.ans.append(curr)
        else:
            if open_cnt < self.n >> 1:
                self.rec(now_open + 1, open_cnt + 1, curr + '(', curr_len + 1)
            if now_open:
                self.rec(now_open - 1, open_cnt, curr + ')', curr_len + 1)

    def generateParenthesis2025(self, n: int) -> list[str]:
        """Версия от 08.08.2025."""
        self.ans = []
        self.n = 2 * n
        self.rec()
        return self.ans

    def generateParenthesis2026(self, n: int) -> list[str]:
        """Версия от 02.10.2026."""
        ans = []
        curr = []
        total = 2 * n

        def rec(bOpen: int = 0, bClose: int = 0) -> None:
            if bOpen + bClose == total:
                ans.append(''.join(curr))
            else:
                if bOpen < n:
                    curr.append('(')
                    rec(bOpen + 1, bClose)
                    curr.pop()
                if bOpen > bClose:
                    curr.append(')')
                    rec(bOpen, bClose + 1)
                    curr.pop()

        rec()
        return ans
