"""
Minimum Sum of Squared Difference.

Даны массивы nums1 и nums2 одинаковой длины n, состоящие из неотрицательных
целых чисел, а также неотрицательные целые числа k1 и k2. Сумма квадратов
разностей считается как sum((nums1[i] - nums2[i]) ** 2), 0 <= i < n. Можно
прибавить один к любому элементу nums1 или вычесть единицу из любого значения
ровно k1 раз. Аналогично можно менять элементы nums2 ровно k2 раз. Найти
минимальную сумму квадратов разностей, которую можно получить после изменения
значений массивов.

Идея решения строится на том, что для минимизации общей суммы нужно сокращать
наибольшие разницы между элементами. Например, уменьшение разности 8 на 1 при
возведении в квадрат даст выигрыш в 15, а уменьшение 4 на 1 улучшит ответ
только на 7. При этом знак разности роли не играет, важно только абсолютное
значение. Таким образом, сначала нам нужно получить модуль разности для
каждого индекса и отсортировать полученный массив по возрастанию.

Дальше встает вопрос о том, насколько сокращать разницу. Доведение наибольшей
разницы до нуля может дать неоптимальный ответ, так как в какой-то момент это
значение перестанет быть максимумом и выгоднее будет менять другое. Поэтому на
каждом шаге будем опускать максимум до соседа справа, который отличается по
значению. В итоге, после каждого шага слева будут оставаться одинаковые числа,
которые равны текущему максимуму. Сами значения в массиве разностей можно не
менять, нужное число всегда будет соседом слева. То есть, величина, на которую
нужно опустить максимум, равна разности текущего и предыдущего значения из
массива разностей, а всего таких максимумом i - индекс текущего шага, если
считать от 0. А общее число прибавлений/ вычитаний равно k1 + k2, так как не
имеет значения, за счет элемента какого массив уменьшать разницу. Если общий
размер "срезки" максимумов не больше текущего значения k, то просто уменьшаем
k на это число и идем дальше. А если операций уже не хватает, то делим k на
i, целую часть этого деления вычитаем из каждого максимума, а из остатка от
деления максимумов еще вычитаем по единице. Находим сумму квадратов, заносим
ее в ответ и выходим из цикла.

Выход из цикла происходит в двух случаях: дошли до конца массива или k стало
равным нулю. В первом случае каждый элемент массива стал максимумом. Можно
также распределить оставшиеся k операций, как и в случае досрочного выхода из
цикла, а можно изначально добавить в конец массива разностей 0. Если дойдем до
конца массива, то все разности станут нулями, значит их сумма 0. А если вышли
из цикла досрочно, то добавляем в ответ все оставшиеся разности в квадрате и
возвращаем результат.

Лучшее решение: 77 ms (97.50%) 38.96 Mb (41.25%)
#array #greedy #sorting
"""


class Solution:

    def minSumSquareDiff(
        self,
        nums1: list[int],
        nums2: list[int],
        k1: int,
        k2: int,
    ) -> int:
        n = len(nums1)
        absDiff = sorted(
            [abs(nums1[i] - nums2[i]) for i in range(n)],
            reverse=True,
        )
        absDiff.append(0)
        k = k1 + k2
        ans = 0
        for i in range(1, n + 1):
            curr, prev = absDiff[i], absDiff[i - 1]
            if curr == prev:
                continue
            diff = prev - curr
            totalDiff = i * diff
            if totalDiff < k:
                k -= totalDiff
            else:
                div, mod = divmod(k, i)
                ans += (
                    (i - mod) * (prev - div) ** 2
                    + mod * (prev - div - 1) ** 2
                )
                k = 0
                break
        if k:
            return 0
        ans += sum(absDiff[j] ** 2 for j in range(i, n))
        return ans
