"""
Find the Winning Player in Coin Game.

Дано количество монет x номиналом 75 единиц и количество монет y номиналом
10 единиц. Алиса и Боб играют в игру. На каждом ходе игрок должен взять ровно
монеты, общий номинал которых равен 115. Если игрок не может этого сделать,
то он проигрывает. Выяснить имя победителя при условии, что Алиса ходит первой.

Получить 115 можно только комбинацией из одной монеты номинала 75 и четырех
монет номинала 10. Количество таких наборов равно min(x, y // 4). Если это
число нечетное, то победителем будет Алиса, иначе - Боб.

Лучшее решение: 0 ms (100%), 19.34 Mb (15.74%)
#math #simulation #game_theory
"""


class Solution:

    def winningPlayer(self, x: int, y: int) -> str:
        combCnt = min(x, y >> 2)
        if combCnt & 1:
            return 'Alice'
        return 'Bob'
