"""
Find the Number of Winning Players.

Дано целое число n, задающее число игроков, и двумерный массив pick, где
pick[i] = [x, y], игрок с номером x вытащил шар цвета y. i-й игрок побеждает
в игре, если он вытащил больше i шаров одного любого цвета (при это игрок
может доставать и шары других цветов). Найти количество игроков, победивших
в игре.

Количество цветов находится не может превышать 11 из ограничений задачи,
поэтому вместо словаря для подсчета можно использовать матрицу, где строки
соответствуют игрокам, а столбцы - номерам цветом. mat[i][j] - кол-во шаров
цвета j, которое вытащил игрок i. По полученной матрице находим кол-во игроков,
у которых в строке есть хотя бы одно значение больше их номера.

Лучшее решение: 2 ms (91.89%), 19.49 Mb (11.26%)
#counting #array
"""


class Solution:

    def winningPlayerCount(self, n: int, pick: list[list[int]]) -> int:
        mat = [[0] * 11 for _ in range(n)]
        for e in pick:
            x, y = e
            mat[x][y] += 1
        return sum(
            1
            for i in range(n)
            if any(mat[i][j] > i for j in range(11))
        )
