"""
Angle Between Hamds of a Clock.

Даны два целых числа hour и minutes, задачающие текущее знчение времени.
Необходимо найти наименьший угол между стрелками часов, которые установлены
на это время.

На циферблате 12 часов, значит угол одного часа составляет 360 / 12 = 30°.
Аналогично получаем угол одной минуты в 6°. Зная положение стрелок часов
можно для каждой из них найти угол до положительного направления оси Y, т.е.
отметки 12 часов. Угол между ними будет равен разности этих значений. Если
он больше 180 градусов, то его нужно вычесть из 360 для получения ответа.
Для минут угол считается как minutes * 6°, а для часов важно учесть, что
стрелка будет указывать не на число hour, а на промежуток между hour и
hour + 1, так как стрелка сдвигается в зависимости от minutes. Таким образом,
для часовой стрелки угол равен (hour + minutes / 60) * 30°.

Лучшее решение: 0 ms (100%), 19.28 Mb (96.89%)
#math
"""


class Solution:

    def angleClock(self, hour: int, minutes: int) -> float:
        minAngle = minutes * 6
        hourAngle = (hour + minutes / 60) * 30
        angle = abs(hourAngle - minAngle)
        return min(angle, 360 - angle)
