"""
Number of Substrings Containing All Three Characters.

Дана строка s, состоящая только из строчных букв 'a', 'b' и 'c'. Найти
количество подстрок, содержащих хотя бы по одному вхождению каждой из этих
букв.

Используем метод скользящего окна переменной длины. Движемся от левой границы
l вправо, пока в окне не окажется как минимум одно вхождение каждой буквы.
Для отслеживания этого состояния используем словарь letter_map и переменную
cnt. В letter_map будем хранить индекс последнего вхождения буквы в подстроку.
Если там None, то это первое вхождение буквы, поэтому увеличиваем cnt на 1.
Как только cnt стал равен трем, то подстрока найдена. При этом к этой подстроке
можно добавить еще любое количество неиспользованных символов справа и
полученные подстроки также будут удовлетворять условию. А также важно учесть,
что внутри окна какие-то буквы повторяются несколько раз. То есть можно
сдвинуть левую границу и оставшаяся подстрока все равно будет подходить для
ответа. При этом к ней также можно добавлять символы справа. Значит вопрос в
том, насколько можно сдинуть левую границу. В словаре letter_map собраны
индексы последних вхождений, значит минимальное из них и будет пределом сдвига
границы l, new_l = min(letter_map.values()) + 1 (делаем переход на следующую
позицию для удобства расчетов). Для выпавшей буквы ставим значение на None
в словаре, уменьшаем cnt на 1, а к ответу добавляем (new_l - l) * (n - r),
то есть кол-во подстрок в окне, содержащих все 3 буквы, умноженное на кол-во
оставшихся символов справа. Вообще символов остается n - r - 1, но для
каждой подстроки еще нужно учесть ее саму, поэтому единица опускается.

Лучшее решение: 57 ms (93.45%), 19.46 Mb (48.97%)
#sliding_window #two_pointers #string
"""


class Solution:

    def numberOfSubstrings(self, s: str) -> int:
        n = len(s)
        ans = 0
        letter_map = {'a': None, 'b': None, 'c': None}
        cnt = 0
        l = 0
        for r in range(n):
            letter = s[r]
            if letter_map[letter] is None:
                cnt += 1
            letter_map[letter] = r
            if cnt == 3:
                new_l = min(letter_map.values()) + 1
                left_letter = s[new_l - 1]
                letter_map[left_letter] = None
                ans += (new_l - l) * (n - r)
                l = new_l
                cnt -= 1
        return ans
