"""
Remove Outermost Parentheses.

Дана строка s, которая представляет собой ПСП - правильную скобочную
последовательность. Простейшей ПСП называется непустая ПСП, которую нельзя
представить в виде A + B, где A и B - ПСП. Необходимо декомпозировать исходную
строку s на простейшие ПСП, то есть s = P1 + P2 + P3 + ..., удалить крайние
скобки каждого такого кусочка, а затем соединить полученные части вместе.

Идем по строке слева направо, поддерживая баланс открытых скобок cnt.
Открывающая скобка увеличивает cnt на 1, закрывающая - уменьшает на 1. Если
баланс стал равен 0, то мы нашли простейшую ПСП. Заносим ее в ответ, опуская
по скобке слева и справа. Левая граница поддерживается переменной left,
правая - right. Так как s - ПСП, то последняя скобка обязательно будет
закрывающей и обработка последнего кусочка пройдет внутри цикла. Поэтому
после него только соединяем все элементы в массиве ans.

Лучшее решение: 3 ms (64.63%), 19.29 Mb (70.87%)
#bracket_sequences #string #stack
"""


class Solution:

    def removeOuterParentheses(self, s: str) -> str:
        ans = []
        cnt = 0
        i = 0
        prev = 1
        for e in s:
            if e == '(':
                cnt += 1
            else:
                cnt -= 1
                if not cnt:
                    ans.append(s[prev:i])
                    prev = i + 2
            i += 1
        return ''.join(ans)
