"""
Maximum Total Subarray Value I.

Дан массив целых неотрицательных чисел nums и целое положительное число k.
Стоимостью подмассива называется разность между его максимумом и минимумом.
Необходимо найти максимальную общую стоимость после выбора k подмассивов из
исходного массива. Подмассивы могут пересекаться, один и тот же подмассив
может быть выбран несколько раз.

Так как можно выбирать один подмассив любое количество раз, то для
максимизации общей стоимости нужно взять подмассив, содержащий максимум и
минимум всего массива, k раз. То есть просто умножаем разницу между максимумом
и минимумом на k.

Лучшее решение: 7 ms (84.36%), 26.31 Mb (92.79%)
#array #greedy
"""


class Solution:

    def maxTotalValue(self, nums: list[int], k: int) -> int:
        return (max(nums) - min(nums)) * k
