"""
Number of Unique XOR Triplets I.

Дан массив nums размера n, который является перестановкой чисел от 1 до n.
Триплетом считается набор (nums[i], nums[j], nums[k]), где i <= j <= k.
Найти количество уникальных значений XOR для всех триплетов массива.

Каждое из исходных чисел достижимо, так как XOR для троекратного взятия одного
числа как раз дает это число. Если n < 3, то какое-то из чисел обязательно
повторяется в триплете и зануляется, давая третье число. То есть в этом случае
можно получить только числа от 1 до n. При n >= 3, ноль всегда достижим.
Также максимальное значение XOR не может превышать 2 ** k - 1, где k - кол-во
бит в n. Так как массив nums является перестановкой чисел от 1 до n, то
достижимы все значения на отрезке [0, 2 ** k - 1], то есть всего 2 ** k.

Лучшее решение: 0 ms (100%), 34.10 Mb (27.12%)
#bit_manipulation #math #array
"""


class Solution:

    def uniqueXorTriplets(self, nums: list[int]) -> int:
        n = len(nums)
        if n < 3:
            return n
        return 1 << n.bit_length()
