"""
Smallest Palindromic Rearrangement I.

Дана строка s, которая является палиндромом. Найти лексикографически наименьшую
перестановку символов строки s, которая также будет палиндромом.

Основная идея состоит в том, чтобы посчитать количество вхождений каждого
символа в строку, разместить их в алфавитном порядке и добавить в ответ
по половине вхождений каждого символа. Затем соединить полученный ответ и его
развернутую версию, аккуратно обработав ситуацию с нечетной длиной строки s.

Так как исходная строка является палиндромом, то каждый символ в ней
встречается четное количество раз. Исключение составляет лишь символ в середине
строки s, если ее длина нечетная. Для получения ответа нам достаточно знать
половину общей частоты для каждого символа, поэтому подсчет можно вести не по
всей строке, а только по первой половине. Так получаем словарь c. Затем
сортируем ключи этого словаря частот и добавляем в ответ строки, полученные
конкатенацией символа k раз, где k - частота. Если длина строки нечетная,
то добавляем символ из середины исходной строки. Возвращаем полученный ответ
и его развернутую версию. При развороте важно не продублировать добавленный
символ из середины.

Лучшее решение: 68 ms (98.62%), 20.80 Mb (79.72%)
#string #sorting #counting
"""
from collections import Counter


class Solution:

    def smallestPalindrome(self, s: str) -> str:
        n = len(s)
        mid = n >> 1
        if not mid:
            return s
        c = Counter(s[:mid])
        ans = [key * c[key] for key in sorted(c.keys())]
        if n & 1:
            ans.append(s[mid])
        return ''.join(ans + ans[len(c) - 1::-1])
