"""
Path Existence Queries in a Graph I.

Дано целое число n, задающие количество вершин в графе, которые пронумерованы
числами от 0 до n - 1. Также дан отсротированный по возрастанию массив nums
и целое число maxDiff. Если |nums[i] - nums[j]| <= maxDiff, то между i-й и
j-й вершинами существует ненправленное ребро. Массив queries представляет
собой набор из пар вершин, для каждой из которых нужно определить, есть ли
между ними путь.

Так как граф неориентированный, то путь между вершинами будет существовать,
если они лежат в одной компоненте связности. Для поиска компонент будем
использовать систему непересекающихся множеств. Изначально каждая вершина
является представителем для самой себя, это массив roots. Будет идти по
списку nums, в качестве представителя выбирая нименьший номер вершины в
компоненте. Это переменная last, которая изначально равна 0. Если разница
между текущей и предыдущей вершиной не больше maxDiff (цикл идет от 1),
то текущую вершину можно привязать к представителю last либо напрямую,
либо через промежуточные вершины, которые уже связаны с last, т.е. roots[i] =
last. В ином случае обновляем last на текущий индекс i, так как это будет
наименьший номер в следующей компоненте, и идем дальше. Для получения ответа
на запрос [u, v] достаточно сравнить roots[u] и roots[v]. Если они равны,
то вершины лежат в одной компоненте и путь есть.

Лучшее решение: 80 ms (69.84%), 49.52 Mb (73.02%)
#union_find #graph_theory
"""


class Solution:

    def pathExistenceQueries(
        self,
        n: int,
        nums: list[int],
        maxDiff: int,
        queries: list[list[int]]
    ) -> list[bool]:
        roots = list(range(n))
        last = 0
        for i in range(1, n):
            if nums[i] - nums[i - 1] <= maxDiff:
                roots[i] = last
            else:
                last = i
        return [roots[query[0]] == roots[query[1]] for query in queries]  
