"""
Number of Ways to Assign Edge Weights I.

Массив edges задает описание дерева, вершины которого помечены целыми числами
от 1 до n. Корень дерева находится в вершине 1. Изначально вес каждого ребра
равен 0. Ребру можно дать вес 1 или 2. Стоимость пути между вершина равна
сумме весов ребер на этом пути. Необходимо вычислить кол-во способов задать
веса от корня до любой вершины на максимальной глубине таким образом, что
стоимость пути будет нечетной.

Сначала переведем список ребер в массив vmap, где каждой вершине соответствует
список смежных вершин. Далее используем поиск в ширину, чтобы определить
глубину дерева. Так как граф является деревом, то путь до любого листа на
максимальной глубине будет одинаковым по количеству ребер и будет равен
значению глубины depth. Для каждого ребра есть 2 возможных варианта веса,
поэтому общее число вариантов равно 2 ** depth. Так как нужно получить
нечетную стоимость, то кол-во весов 1 должно быть нечетным. Например, при
глубине 5 это будет 1, 3 или 5. Количество вариантов размещения такого числа
единиц определяется как биноминальный коэффициент. Если посмотреть значения
на нескольких примерах, то можно заметить, что сумма таких коэффициентов для
всех вариантов равна 2 ** (depth - 1). Это и есть ответ.

Лучшее решение: 247 ms (95.70%), 66.54 Mb (82.80%)
#math #tree #bfs
"""


class Solution:

    def assignEdgeWeights_bfs(self, edges: list[list[int]]) -> int:
        mod = 10 ** 9 + 7
        vcnt = len(edges) + 1
        vmap: list[list[int]] = [[] for _ in range(vcnt + 1)]
        for e in edges:
            u, v = e
            vmap[u].append(v)
            vmap[v].append(u)
        depth = 0
        q = [1]
        visited = [False] * (len(edges) + 2)
        while q:
            newq = []
            for e in q:
                visited[e] = True
                for v in vmap[e]:
                    if not visited[v]:
                        newq.append(v)
            depth += 1
            q = newq
        return (1 << (depth - 2)) % mod 
