"""
Maximum Nesting Depth of the Parentheses.

Дана строка s, представляющая собой математическое выражение. Необходимо найти
максимальную глубину вложенных скобок. Гарантируется, что скобки в строке
образуют правильную скобочную последовательность.

Будем поддерживать счетчик cnt открытых на данный момент скобок. Идем циклом
по строке. Открывающая скобка увеличивает счетчик на 1, а закрывающая -
уменьшает на 1. Также при закрывающей скобке обновляем ответ на значение
счетчика до уменьшения, если он больше текущего значения, так как cnt как
раз и будет показывать глубину вложенности для выражения в скобках, которые
закрываются на данном этапе.

Лучшее решение: 0 ms (100.00%), 19.17 Mb (85.35%)
#bracket_sequence #string
"""


class Solution:

    def maxDepth(self, s: str) -> int:
        ans = 0
        cnt = 0
        for e in s:
            if e == "(":
                cnt += 1
            elif e == ")":
                ans = max(ans, cnt)
                cnt -= 1
        return ans
