"""
Smallest Stable Index II.

Дан массив целых неотрицательных чисел nums и целое число k. Индекс i
называется стабильным, если max(nums[:i + 1]) - min(nums[i:]) <= k. Найти
минимальный стабильный индекс.

Основная идея состоит в использовании префиксных/суффиксных значений. Так как
нужно найти минимальный индекс, то поиск пойдет слева направо, значит можно
не хранить значение максимума для каждого индекса, а обновлять его в процессе.
А вот минимумы лучше сохранить в отдельный массив. Тогда на каждом шаге за O(1)
можно сказать, подходит этот индекс или нет. Если индекс удовлетворяеят
условию, то возвраащем его. Если опция возврата так и не была активирована,
то нужного индекса нет, поэтому ответ -1.

Можно немного сократить память в общем случае. Если массив nums не состоит
из разных чисел в порядке возрастания, то в массиве суффиксных минимумов будет
много повторений одинаковых чисел подряд в случаях, когда минимум на данном
индексе не изменился. Поэтому заведем stack, в который будем сохранять индексы
позиций, где минимум на суффиксе поменялся. Стек заполняется справо налево,
поэтому на вершине будет лежать первая справа позиция минимума во всем массиве.
Внешним циклом идем, пока стек не пуст. Снимаем индекс thr с вершины, обновляем
минимальное значение minVal на nums[thr]. Внутренний цикл проходит от прошлого
снятого индекса (переменная left) до текущего. На каждом шаге обновляем
накопленный максимум и сравниваем разницу максимума и минимума с k. 

Лучшее решение: 85 ms (96.82%), 31.49 Mb (95.00%)
#prefix_sum #array #stack
"""


class Solution:

    def firstStableIndex(self, nums: list[int], k: int) -> int:
        n = len(nums)
        stack = []
        minVal = float('inf')
        for i in range(n - 1, -1, -1):
            num = nums[i]
            if num < minVal:
                stack.append(i)
                minVal = num
        left = 0
        maxVal = float('-inf')
        while stack:
            thr = stack.pop()
            minVal = nums[thr]
            target = minVal + k
            for j in range(left, thr + 1):
                if nums[j] > maxVal:
                    maxVal = nums[j]
                if maxVal <= target:
                    return j
            left = thr + 1
        return -1
