"""
Minimum Cost of Buying Candies With Discount.

Дан массив целых положительных чисел cost, где cost[i] - цена i-й конфеты.
В магазине действует промоакция: при покупке 2-х конфет 3-я в подарок, если
ее стоимость не превышает минимальную стоимость одной из купленных конфет.
Найти минимальную сумму, которую нужно потратить, чтобы купить все конфеты.

Сортируем массив в порядке убывания и делим его на тройки. К ответу добавляем
стоимость первых 2-х конфет из тройки, а оставшаяся будет идти в подарок. Ее
стоимость удовлетворяет условию, так как массив отсортирован, и является
оптимальной, так как цена всех остальных конфет точно не выше.

Лучшее решение: 0 ms (100%), 19.20 Mb (84.98%)
#array #sorting #greedy
"""


class Solution:

    def minimumCost(self, cost: list[int]) -> int:
        cost.sort(reverse=True)
        n = len(cost)
        ans = 0
        for i in range(0, n, 3):
            ans += cost[i]
            if i < n - 1:
                ans += cost[i + 1]
        return ans
