"""
Minimum Add to Make Parentheses Valid.

Дана строка s, состоящая только из открывающих и закрывающих скобок. Найти
минимальное количество скобок, которое нужно добавить в строку, чтобы она
стала правильной скобочной последовательностью. Скобки можно добавлять в
любое место строки.

Идем циклом по строке и поддерживаем баланс открытых скобок на текущий момент,
переменная cnt. Открывающая скобка увеличивает cnt на 1, закрывающая -
уменьшает на 1. Если при вычитании единицы счетчик стал отрицательным, то
увеличиваем общий ответ ans на 1 и возвращаем счетчик к нулю, так как для
получения ПСП нужно открыть скобку до текущего момента. После цикла прибавляем
значение счетчика к ответу, так как могли остаться незакрытые скобки в случае
cnt > 0.

Лучшее решение: 0 ms (100.00%), 19.19 Mb (86.71%)
#bracket_sequences #greedy #string
"""


class Solution:

    def minAddToMakeValid(self, s: str) -> int:
        ans = 0
        cnt = 0
        for e in s:
            if e == '(':
                cnt += 1
            else:
                cnt -= 1
                if cnt < 0:
                    ans += 1
                    cnt = 0
        return ans + cnt
