"""
Valid Parenthesis String.

Дана строка s, содержащая столько символы '(', ')' и '*'. '*' можно заменить
на '(', ')' или ''. Выяснить, можно ли получить из текущей строки правильную
скобочную последовательность.

Можно реализовать 2 подхода. Идея первого состоит в том, чтобы при переходе
к следующей скобке поддерживать множество допустимых значений числа открытых
скобок. Назовем это множество options, изначально в нем лежит 0, так как
скобки пока не открыты. Идем циклом по строке. Если скобка открывающая, то
к каждому значению в options добавляем 1, если закрывающая - вычитаем из
каждого варианта 1 и оставляем только числа больше 0, так как варианты с
отрицательным балансом уже точно не дадут ПСП. Если текущий элемент - '*',
то множество options получается объединением текущего множества, а также его
видов после прибавления 1 к каждому значению и после вычитания 1 из каждого
числа и удаления отрицательных значений, так как для '*' есть 3 варианта.
ПСП можно получить, если после цикла в множестве будет 0. Такой подход
требует O(N ** 2) по времени и O(N) по памяти, но так как длина s не превышает
100, то работает все равно быстро.

Другой подход занимает O(N) по времени и O(1) по памяти и развивает предыдущую
идею. Нам не нужно знать все варианты баланса, которые могут сложиться к концу
сттроки, нужно только понять, будет ли среди них 0. Поэтому вместо хранения
множества будем хранить его левую и правую границы, minVal и maxVal. При
открывающей скобке обе границы увеличиваются на 1, при закрывающей скобке -
уменьшаются на 1. Если при закрывающей скобке верхняя граница стала
отрицательной, то можно сразу вернуть False, ведь большее число скобок до
этого момента открыть нельзя. Также важно аккуратно работать с левой границей
при вычитании. Если она становится отрицательной, то устанавливаем ее на 0,
то есть отсекаем варианты, которые уже на промежуточной стадии точно не дадут
ПСП. При '*' сдвигаем верхнюю границу на 1 вправо, а из нижней вычитаем 1.
Если после цикла нижняя граница стала нулем, то ПСП возможна. На длинных
строках такой подход эффективнее.

Лучшее решение: 0 ms (100.00%), 19.02 Mb (98.41%)
#bracket_sequences #greedy #dynamic_programming
"""


class Solution:

    def checkValidString(self, s: str) -> bool:
        options = {0}
        for e in s:
            if e == '(':
                options = {e + 1 for e in options}
            elif e == ')':
                options = {e - 1 for e in options if e - 1 >= 0}
            else:
                options = (
                    options
                    | {e - 1 for e in options if e > 0}
                    | {e + 1 for e in options}
                )
        return any(e == 0 for e in options)

    def checkValidString2(self, s: str) -> bool:
        minVal, maxVal = 0, 0
        for e in s:
            if e == '(':
                minVal += 1
                maxVal += 1
            elif e == ')':
                maxVal -= 1
                if maxVal < 0:
                    return False
                minVal = max(minVal - 1, 0)
            else:
                minVal = max(0, minVal - 1)
                maxVal += 1
        return minVal == 0
