"""
Process String With Special Operations II.

Дана строка s, состоящая из строчных английских букв и символов *, #, %, а
также целое неотрицательное число k. Необходимо найти k-й символ итоговой
строки result, которая формируется в результате обработки s по следующим
правилам:
- s[i] == '*' - удалить последний символ result, если он есть, то есть строка
  result непустая.
- s[i] == '#' - продублировать текущий результат и добавить его в конец.
- s[i] == '%' - развернуть текущий результат.
- s[i] = буква - добавить в конец результата.

Строка result может достигать длины 10 ** 15, поэтому физически формировать
ее слишком затратно по времени и памяти. Поступим иначе. Сначала пройдем по
s слева направо и найдем только длину result. А далее будем искать не k-й
символ в чистом виде, а как бы путь искомого ответа до k-й позиции. Для этого
идем по s справа налево, пока k < total_length. Если это не так, то либо
индекса k вообще не было в результате и нужно вернуть '.', либо последняя
добавленная буква как раз и дошла до позиции k, поэтому будет ответом. Внутри
цикла изменяем длину и корректируем значение k:
- s[i] == '*' - последний символ был удален, значит длина строки была на 1
  больше -> total_length += 1, k не меняется.
- s[i] == '#' - было дублирование, значит длина строки была в 2 раза меньше,
  а новое значение k определяется как остаток от деления на эту длину ->
  total_length //= 2, k %= total_length.
- s[i] == '%' - был разворот, длина строки не менялась, а новая позиция k
  будет зеркальной относительно серидины result -> k = total_length - 1 - k.
- s[i] = буква - был добавлен символ, длина строки была меньше на 1, также
  нужно обновить значение последнего добавленого символа last -> last = s[i],
  total_length -= 1

Лучшее решение: 335 ms (75.00%), 20.62 Mb (77.08%)
#string #simulation
"""


class Solution:

    def processStr(self, s: str, k: int) -> str:
        total_length = 0
        for e in s:
            if e == '*':
                if total_length:
                    total_length -= 1
            elif e == '#':
                total_length *= 2
            elif e == '%':
                continue
            else:
                total_length += 1
        n = len(s)
        last = '.'
        for i in range(n - 1, -1, -1):
            if k >= total_length:
                return last
            e = s[i]
            if e == '*':
                total_length += 1
            elif e == '#':
                total_length //= 2
                k %= total_length
            elif e == '%':
                k = total_length - 1 - k
            else:
                total_length -= 1
                last = e
        return last
