"""
Prefict the Winner.

Дан массив целых неотрицательных чисел nums. Алиса и Боб играют в игру. За
один ход можно взять число с левого или правого конца массива и добавить
это число к сумме своих очков. Размер массива сокращается на 1. То есть,
если текущий массив находится на отрезке [l, r] и игрок берет элемент nums[l],
то следующий игрок уже выбирает на отрезке [l + 1, r]. Выяснить, победит ли
Алиса в игре, если она ходит первой, а оба игрока играют оптимально.

Оба игрока играют оптимально, то есть каждый игрок старается максимизировать
свой выигрыш в каждом состоянии. Жадный алгоритм здесь не подходит, так как не
учитывает все промежуточные значения на отрезке, а также стратегию второго
игрока. Можно рекурсивно перебрать все варианты с использованием мемоизации
и получить ответ, но это достаточно долго даже при небольших размерах nums.

Обратимся к динамическому программированию. Каждый игрок на своем ходе хочет
максимизировать свой итоговой выигрыш. Пусть diff(l, r) - разница между очками
игрока 1 (который ходит первым на этом отрезке) и очками второго игрока. Игрок
1 может взять элемент nums[l], тогда второй игрок будет максимизировать свои
очки на отрезке [l + 1, r] = diff(l + 1, r) = очки игрока 2 - очки игрока 1.
Если вернуться к первому игроку, то для него выигрыш при таком ходе составит
nums[l] - diff(l + 1, r). Аналогично при взятии nums[r] его разница очков
будет равна nums[r] - diff(l, r - 1). Игрок 1 максимизирует свой выигрыш,
значит он берет max(nums[l] - diff(l + 1, r), nums[r] - diff(l, r - 1)).
Это и есть diff(l, r) - наилучшая разница очков для игрока, который ходит
первым на этом отрезке.

Пусть строки матрицы dp отвечают за левую границу отрезка, столбцы - за правую.
Тогда все значения под диагональю i = j не заполняются, так как начало отрезка
не может быть больше его конца. dp[i][i] = nums[i], так как при длине 1 игрок,
который ходит первым, просто выбирает это единственное число, а у другого
игрока так и будет ноль очков. Это база динамики. Далее заполнение идет по
диагоналям, которые отвечают за отрезки разной длины. Диагональ i = j - 1 - за
отрезки длины 2, i = j - 2 - отрезки длины 3 и т.д. Нельзя идти по строкам или
столбцам, так как для расчета текущего значения нужна ответы для 2-х вложенных
отрезков меньшей длины, которые находятся на диагоналях. Для ответа смотрим
на значение dp[0][len(nums) - 1]. Это максимальный выигрыщ Алисы при игре на
всем массиве. Если он неотрицательный, то она победила.

Лучшее решение: 0 ms (100%), 19.20 Mb (94.59%)
#game_theory #dynamic_programming #math
"""


class Solution:

    def predictTheWinnerMatrix(self, nums: list[int]) -> bool:
        """Решение с использованием квадратной матрицы."""
        n = len(nums)
        dp = [[-1] * n for _ in range(n)]
        for i in range(n):
            dp[i][i] = nums[i]
        for j in range(1, n):
            for i in range(n - j):
                dp[i][i + j] = max(
                    nums[i] - dp[i + 1][i + j],
                    nums[i + j] - dp[i][i + j - 1],
                )
        return dp[0][n - 1] >= 0

    def predictTheWinnerArray(self, nums: list[int]) -> bool:
        """Решение с использованием массива вместо матрицы."""
        n = len(nums)
        dp = nums.copy()
        for j in range(1, n):
            for l in range(n - j):
                r = l + j
                dp[l] = max(nums[l] - dp[l + 1], nums[r] - dp[l])
        return dp[0] >= 0
