"""
Find Target Indices After Sorting Array.

Дан массив целых положительных чисел nums и целое число target. Найти все
индексы i в отсортированном по возрастанию массиве nums, для которых
выполняется условие, что nums[i] == target. Найденные индексы должны
располагаться в порядке возрастания.

После сортировки все числа, меньшие target, окажутся слева от него, то есть
количество таких чисел - самый маленький индекс target в ответе, так как
массив nums нумеруется с нуля. Правая граница ответа будет равна сумме кол-ва
меньших чисел less и кол-ва равных target чисел (переменная equal) за вычетом
единицы. В отсортированном массиве равные числа идут друг за другом, поэтому
для ответа просто преобразуем range в список и возвращаем его. Так как правая
граница range не включается в ответ, то не добавляем минус единицу.

Лучшее решение: 0 ms (100.00%), 19.16 Mb (90.46%)
#array #sorting #greedy
"""


class Solution:

    def targetIndices(self, nums: list[int], target: int) -> list[int]:
        less, equal = 0, 0
        for num in nums:
            if num < target:
                less += 1
            elif num == target:
                equal += 1
        return list(range(less, less + equal))
