"""
Minimum Number of Pushes to Type Word II.

Дана строка word, содержащая только строчные латинские буквы. Предположим,
что есть кнопочный телефон, где каждой цифре от 2 до 9 можно поставить в
соответствие любую комбинацию букв. Для набора первой буквы комбинации нужно
одно нажатие, для второй буквы - два нажатия, и т.д. Необходимо найти
минимальное количество нажатий кнопок телефона при некотором разделении букв,
чтобы набрать строку word.

Идея в том, чтобы буквы, которые используются в строке часто, находились в
начале комбинации для какой-то кнопки, тогда для наборы каждой из них
количество нажатий будет минимально. Считаем частоту каждой буквы с помощью
Counter и сортируем полученные значения в порядке убывания (массив vals).
Первые восемь значений - максимальные частоты, они соотвествуют буквам, которые
будут стоять на первом месте в комбинации. Их восемь, потому что всего 8
доступных кнопок. Так как они стоят на первом месте, то для каждого набора
этой буквы требуется одно нажатие. То есть в ответ идет sum(vals[0:8]).
Следующие 8 частот соответствуют буквам, которые будут вторыми в комбинации,
для их набора понадобится по 2 нажатия, то есть 2 * sum(vals[8:16]). На
следующие 8 букв нужно по 3 нажатия, на оставшиеся, если они есть, по 4. Более
4 нажатий быть не может, потому что в алфавите 26 букв. Можно вручную прописать
4 слагаемых, а можно заметить, что каждое значение в vals будет умножаться
на i // 8 + 1, где i - индекс значения в vals.

Лучшее решение: 98 ms (70.61%), 19.95 Mb (77.03%)
#string #sorting #counting
"""
from collections import Counter


class Solution:

    def minimumPushes(self, word: str) -> int:
        c = Counter(word)
        vals = sorted(c.values(), reverse=True)
        return sum(vals[i] * (i // 8 + 1) for i in range(len(c)))
