"""
Find the Maximum Number of Elements in Subset.

Дан массив целых положительных чисел nums. Необходимо найти наибольшее кол-во
элементов, которое может быть добавлено в выборку, удовлетворяющую следующей
схеме: [x, x ** 2, x ** 4, ..., x ** k/2, x ** k, x ** k/2, ..., x ** 4,
x ** 2, x], где k - целое неотрицательное число. Например, [2, 4, 16, 4, 2]
или [3, 9, 3] подходят под условие, но [2, 4, 8, 4, 2] нет, так как 8 не
является квадратом четверки.

Основная идея состоит в том, чтобы строить последовательные цепочки чисел
и определять их длины. Для этого сначала посчитаем частоту каждого числа
в nums. Единица в любой степени равна самой себе, поэтому, если она есть в
nums, ответом для нее будет либо ее частота, если она нечетная, либо из этой
частоты нужно вычесть 1. Удаляем единицу из словаря частот c. Также создаем
словарь cache, в котором будем хранить уже полученные ответы для чисел.
Этот прием поможет не использовать сортировку ключей. Например, мы взяли
число 4 из словаря и смогли построить цепочку длины 3, [4, 16, 4], то есть
cache[4] = 3. На какой-то из следующих итераций цикла извлекли число 2.
Следующим числом будет 4 и мы уже знаем, что для него ответ 3, значит для
2 ответом будет 5, так как цепочки от четверки встроится в середину и нет
необходимости снова полностью проходить всю последовательность до 16.

На каждой итерации цикла извлекаем случайную пару из словаря частот c,
значения num и freq. Если частота числа равна 1, то просто обновляем кеш
как cache[num] = 1 и берем следующее число. Ответ это не улучшит, так массив
не может быть пуст по условию, значит один элемент можно выбрать всегда.
Если freq > 1, то устанавливаем текущую длину на 2 и идем по словарю, пока
там есть число next_num, которое изначально равно num * num, и его частота
больше 1. На каждом шаге увеличиваем длину length на 2 и удаляем уже
пройденные элементы, так как перебирать их во внешнем цикле нет смысла, для
них длина цепочки будет заведомо меньше, чем для исходного num. Если вышли из
внутреннего из-за того, что next_num нет в c, то возможны два варианта. Если
next_num есть в cache, то ответом для num будет length + cache[next_num],
иначе - вычитаем из length единицу, так как предшествующее число будет
серединой цепочки. А при выходе из-за частоты равной единице как раз next_num
будет серединой, поэтому к length прибавляем 1. Записываем значение для num
в кеш и обновляем ответ.

Лучшее решение: 103 ms (77.95%), 31.82 Mb (38.58%)
#array #hash_table #counting
"""
from collections import Counter


class Solution:

    def maximumLength(self, nums: list[int]) -> int:
        c = Counter(nums)
        ans = 1
        if 1 in c:
            ans = c[1] - ((c[1] + 1) & 1)
            c.pop(1)
        cache = {}
        while c:
            num, freq = c.popitem()
            if freq < 2:
                cache[num] = 1
                continue
            length = 2
            next_num = num * num
            while next_num in c and c[next_num] > 1:
                length += 2
                c.pop(next_num)
                next_num *= next_num
            if next_num not in c:
                cache[num] = length + cache.get(next_num, -1)
            else:
                cache[num] = length + 1
            ans = max(ans, cache[num])
        return ans
