"""
Maximum Nesting Depth of Two Valid Parentheses Strings.

Дана строка seq, представляющая собой правильную скобочную последовательность
(ПСП). Необходимо разделить ее на 2 подстроки таким образом, чтобы каждая
из них являлась ПСП, а максимальная вложенность скобок в них была наименьшей
из возможных. Если обозначить эти подстроки как A и B, а глубину вложенности
как depth(A) и depth(B), то max(depth(A), depth(B)) должен быть минимальным.
Подстрока является набором символов исходной строки, которые могут не стоять
рядом друг с другом, но сохраняют исходный порядок относительно друг друга.

Для каждой подстроки заведем счетчики числа открытых скобок на данный момент.
Идем циклом по строке. Если скобка открывающая, то она добавляется в подстроку
с меньшим значением счетчика и увеличивает его на 1. Если скобка закрывающая,
то он кладется в подстроку с большим значением счетчика и уменьшает его на 1.
Счетчики будут отличаться не более, чем на 1, а так как исходная строка
является ПСП, то подстроки при таком подходе тоже будут ПСП.

Лучшее решение: 0 ms (100.00%), 19.39 Mb (63.43%)
#bracket_sequences #string
"""


class Solution:

    def maxDepthAfterSplit(self, seq: str) -> list[int]:
        n = len(seq)
        ans = [0] * n
        cnt1, cnt2 = 0, 0
        for i in range(n):
            e = seq[i]
            if e == '(':
                if cnt1 <= cnt2:
                    ans[i] = 0
                    cnt1 += 1
                else:
                    ans[i] = 1
                    cnt2 += 1
            else:
                if cnt1 <= cnt2:
                    ans[i] = 1
                    cnt2 -= 1
                else:
                    ans[i] = 0
                    cnt1 -= 1
        return ans
