"""
Shortest and Lexicographically Smallest Beautiful String.

Дана бинарная строка s и целое число k. Найти лексикографически наименьшую
строку наименьшей возможной длины, которая содержит ровно k единиц.

Используем метод двух указателей. Левую границу left ставим на место первого
вхождения единицы в строку s и идем вправо, считая единицы в подстроке.
Итоговые границы ansl и ansr определяем как 0 и -1 (-1 позволяет понять,
что граница еще не была задана). Когда счетчик cnt станет равным k, смотрим,
надо ли обновлять границы ответа. Обновление идет, если итоговые границы
стоят на дефолтных значениях, либо длина текущей подстроки меньше длины ответа,
либо длины подстрок совпадают, но текущая строка лексикографически меньше.
После этого сдвигаем указатель left на первую единицу от его текущей позиции
и уменьшаем счетчик на 1. В качестве ответа возвращаем подстроку на найденном
интервале.

Лучшее решение: 0 ms (100%), 19.38 Mb (30.63%)
#string #sliding_window #two_pointers
"""


class Solution:

    def shortestBeautifulSubstring(self, s: str, k: int) -> str:
        n = len(s)
        left = s.find('1')
        ansl, ansr = 0, -1
        cnt = 0
        for right in range(left, n):
            if s[right] == '1':
                cnt += 1
            if cnt == k:
                sLen = right - left
                cond = (
                    ansr == -1
                    or sLen < (ansr - ansl)
                    or (
                        sLen == (ansr - ansl)
                        and s[left: right + 1] < s[ansl: ansr + 1]
                    )
                )
                if cond:
                    ansl, ansr = left, right
                left = s.find('1', left + 1)
                cnt -= 1
        return s[ansl: ansr + 1]
