"""
Length of Longest Subarray With at Most K Frequency.

Дан массив целых положительных чисел nums и целое число k. Найти размер
наибольшего подмассива, в котором каждый элемент встречается не чаще,
чем k раз.

Используем метод скользящего окна переменной длины. Заведем переменные curr -
длина текущего подмассива и left - позиция левого указателя, а также словарь
частот cnt. Идем по массиву слева направо и на каждой итерации увеличиваем
частоту текущего элемента и длину подмассива на 1. Если частота стала больше
k, то обновляем общий ответ, если curr - 1 > ans, а затем двигаем левый
указатель и удаляем вхождения элементов под ним, пока частота текущего
элемента не станет равна k. В этом же цикле уменьшаем и curr, чтобы
поддерживать актуальную длину подмассива. В качестве ответа возвращаем
максимум из ans и curr, чтобы учесть случай, когда нужный подмассив оказался
в конце исходного массива.

Лучшее решение: 197 ms (99.70%) 35.31 Mb (38.32%)
#sliding_window #two_pointers #hash_table
"""


class Solution:

    def maxSubarrayLength2(self, nums: list[int], k: int) -> int:
        ans = float('-inf')
        curr = 0
        cnt = {}
        left = 0
        for num in nums:
            cnt[num] = cnt.get(num, 0) + 1
            curr += 1
            if cnt[num] > k:
                if curr - 1 > ans:
                    ans = curr - 1
                while cnt[num] > k:
                    leftNum = nums[left]
                    cnt[leftNum] -= 1
                    curr -= 1
                    left += 1
        return max(ans, curr)
