"""
Count the Number of Complete Components.

Дано целое число n, задающее число вершин в неориентрованном графе. Ребра
графа описаны в массиву edges, edges[i] = [a, b], соединенные ребром вершины
графа. В графе нет петель и кратных ребер. Найти количество полных компонент
в этом графе.

Используем систему непересакающихся множеств. В массиве roots для каждой
вершины будем хранить номер представителя множества, к которому эта вершина
относится. Изначально все вершины указывают на себя. В массивах vCnt и eCnt
будем хранить количетсво вершин и количество ребер для i-й вершины, если она
является представителем множества. Компонента, представителем которой является
вершина i, будет полной, если vCnt[i] * (vCnt[i] - 1) == 2 * eCnt[i]. Исходно
каждая вершина является представителем для себя, поэтому количество вершин
равно 1, а количество ребер - 0.

Идем по списку ребер. Для каждой пары вершин a и b находим преставителей их
множеств. Для этого идем по массиву roots, пока roots[a/b] != a/b. Если
представители совпадают, то вершины уже лежат в одной компоненте, то есть
количество вершин в ней не меняется, но добавляется одно ребро, eCnt[a] += 1.
Если номера представителей не равны, то нужно связать 2 компонеты. По умолчанию
выбираем общим представителем a, roots[b] = a. Чтобы несколько ускорить
процесс поиска представителя на последующих шагах цикла, при поиске
представителя для исходной вершины b сохраняем весь путь до этого
представителя, а затем меняем значение roots для каждой вершины на этом пути.
К компоненте с представителем a добавляем количество вершин и ребер из второй
компоненты, vCnt[a] += vCnt[b], eCnt[a] += eCnt[b], а также обнуляем кол-во
вершин для b, vCnt[b] = 0. Обнуление необходимо, так как положительное значение
в vCnt служит индикатором, что i-я вершина - представитель множества. Для
ответа проходимся по всем представителяем и считаем количество тех, для кого
выполнилось неравенство.

Лучшее решение: 23 ms (95.81%), 19.68 Mb (90.53%)
#union_find #graph_theory
"""


class Solution:

    def countCompleteComponents(self, n: int, edges: list[list[int]]) -> int:
        roots = list(range(n))
        vCnt = [1] * n
        eCnt = [0] * n
        for edge in edges:
            a, b = edge
            while roots[a] != a:
                a = roots[a]
            way = [b]
            while roots[b] != b:
                b = roots[b]
                way.append(b)
            eCnt[a] += 1
            if a != b:
                for ver in way:
                    roots[ver] = a
                vCnt[a] += vCnt[b]
                eCnt[a] += eCnt[b]
                vCnt[b] = 0
        ans = 0
        for i in range(n):
            v, e = vCnt[i], eCnt[i]
            if v and v * (v - 1) == 2 * e:
                ans += 1
        return ans
