"""
Maximum Twin Sum of a Linked List.

Дан односвязный список целых положительных чисел. Список имеет четную длину
и не может быть пустым. Пусть n - длина списка, необходимо найти максимальное
значение выражения l[i] + l[n - 1 - i], где l[i] - i-й элемент списка при
нумерации с нуля.

Основаня идея состоит в том, чтобы развернуть первую половину списка и идти
двумя указателями в разные концы списка, считая сумму значений под указателями.
Для установки указателей воспользуемся методом "зайца и черепахи". "Заяц" буедт
идти по списку с шагом 2, "черепаха" - с шагом 1. Указатели двигаются, пока
под "зайцем" не окажется None. Так как длина списка четная, то "черепаха"
остановится на узле n // 2, а указатель prev - на n // 2 - 1. prev будем
использовать сначала для разворота ссылки при каждом движении slow, а затем
для поиска ответа. slow будет указывать на первый узел, у которого сохранена
исходная ссылка, поэтому при подсчете суммы он будет двигаться в конец списка,
а prev - в начало. Список четной длины, поэтому оба этих указателя встанут на
None одновременно, то есть дополнительные проверки не нужны.

Лучшее решение: 50 ms (88.51%), 44.20 (97.03%)
#linked_list #two_pointers
"""


class ListNode:

    def __init__(self, val=0, next=None):
        self.val = val
        self.next = next

    def __str__(self):
        arr = []
        while self:
            arr.append(self.val)
            self = self.next
        return ' -> '.join(map(str, arr))


class Solution:

    def pairSum(self, head: ListNode) -> int:
        ans = 0
        slow = head
        prev = None
        while head:
            head = head.next.next
            next_node = slow.next
            slow.next = prev
            slow, prev = next_node, slow
        while prev:
            curr = slow.val + prev.val
            if curr > ans:
                ans = curr
            slow = slow.next
            prev = prev.next
        return ans
