"""
Score of Parentheses.

Дана правильная скобочная последовательность s. Необходимо найти ее значение,
которое считается по следующим правилам:
- score("()") = 1;
- score("AB") = score(A) + score(B), где A и B - ПСП;
- score("(A)") = 2 * score(A), где A - ПСП.

Используем стек, в котором будем хранить значения ПСП внутри текущей открытой
скобки. Идем циклом по строке. Если скобка открывающая, то кладем в стек 0,
на данном этапе мы не знаем, какую ПСП внутри она содержит. Если скобка
закрывающая, то снимаем последнее число в стеке и действуем относительно него.
Если там стоит 0, то мы закрыли ПСП вида "()", ее значение равно 1. Если там
какое-то положительное число, то внутри закрываемого участка есть какая-то
непустая ПСП, поэтому умножаем это число на 2. Полученное значение прибавляем
к последнему элементу в стеке, так как при конкатенации 2-х ПСП их значения
суммируются. Возможен случай, когда слева от закрытого участка ничего нет,
поэтому в начало стека сразу кладем 0, который как раз будет отвечать за эту
часть. Конкатенация = суммирование, значит логика алгоритма от этого не
нарушится, зато не нужно отдельно обрабатывать случай с пустым стеком. Ответом
как раз и будет нулевое значения стека, так как исходная строка - ПСП, значит
в стеке обязательно останется ровно 1 число.

Лучшее решение: 0 ms (100.00%), 19.08 Mb (97.89%)
#bracket_sequences #stack #string
"""


class Solution:

    def scoreOfParentheses(self, s: str) -> int:
        stack = [0]
        for e in s:
            if e == '(':
                stack.append(0)
            else:
                last = stack.pop()
                if last == 0:
                    curr = 1
                else:
                    curr = 2 * last
                stack[-1] += curr
        return stack[0]
